
use core::fmt;
use crate::wasm4::*;
use crate::assets::img::{TILE_STAGE};
use crate::utils::*;

// -------------------------------
// Enums
// -------------------------------
// ステージ識別用のID
#[derive(Copy, Clone, Debug, PartialEq)]
pub enum StageID {
  Stage1,
  Stage2,
}
// タイル識別用のID
#[derive(Copy, Clone, Debug, PartialEq)]
pub enum TileId {
  Empty,
  Start,

  Wall,
  NeedleUp,
  NeedleRight,
  NeedleLeft,
  NeedleDown,
  GoalClosed,
  GoalOpened,

  Key,
  Fragment,
}
impl fmt::Display for TileId {
  fn fmt(&self, f: &mut fmt::Formatter) -> fmt::Result {
    write!(f, "{:?}", self)
  }
}
// プレイヤーの行動でステージに変化がある際のコマンド集
#[derive(Copy, Clone, Debug, PartialEq)]
pub enum InteractiveCmd {
  GetKey(i16, i16),
  GetFragment(i16, i16),
  ClearStage,
}

// -------------------------------
// Structs
// -------------------------------
// 不変の要素
#[derive(Copy, Clone, Debug)]
pub struct Tile {
  pub id: TileId,
  pub pos: Vec2i,
  
}
// ステージのデータ格納用
struct StageData {
  width: u16,
  height: u16,
  data: &'static [char],
}
impl StageData {
  // 文字のステージデータをTileIDへ変換する
  pub fn get_tiles(&self) -> Vec<Tile> {
    let mut result = Vec::with_capacity((self.width * self.height) as usize);
    for i in 0..(self.width * self.height) as usize {
      result.push(
        Tile{id: self.char_to_tile_id(self.data[i]), 
             pos: Vec2i { x: (( i as u16 % self.width ) * STAGE_TILE_SIZE) as i16,
                          y: (( i as u16 / self.width ) * STAGE_TILE_SIZE) as i16 }})
    }
    return result
  }
  // ヘルパー
  fn char_to_tile_id(&self, c: char) -> TileId {
    match c {
      ' ' => { TileId::Empty }
      '#' => { TileId::Wall }
      '^' => { TileId::NeedleUp }
      '>' => { TileId::NeedleRight }
      '<' => { TileId::NeedleLeft }
      'v' => { TileId::NeedleDown }
      '@' => { TileId::Start }
      'k' => { TileId::Key }
      'f' => { TileId::Fragment }
      'g' => { TileId::GoalClosed }
      _   => { TileId::Empty }
    }

  }
}

// ステージ描画補佐
pub struct StageHandler {
  now_stage: &'static StageData,
  now_stage_idx: usize,
  start_tile_idx: usize,
  goal_tile_idx:  usize,
  fragment_count: u8,
  tiles: Vec<Tile>
}
impl StageHandler {
  pub fn new() -> Self {
    let mut result = Self {
      now_stage: DAT_STAGE_ALL[0],
      now_stage_idx: 0,
      start_tile_idx: 0,
      goal_tile_idx: 0,
      fragment_count: 0,
      tiles: DAT_STAGE_ALL[0].get_tiles()
    };
    result.setup();
    return result;
  }
  fn setup(&mut self) {
    self.start_tile_idx = self.tiles.iter().position(|t| t.id == TileId::Start).unwrap();
    self.goal_tile_idx = self.tiles.iter().position(|t| t.id == TileId::GoalClosed).unwrap();
  }

  fn get_idx_from_pos(&self, x: i16, y: i16) -> usize {
    let ix = x / STAGE_TILE_SIZE as i16;
    let iy = y / STAGE_TILE_SIZE as i16;
    return (self.now_stage.width as i16 * iy + ix) as usize;
  }

  pub fn update(&mut self, cmds: [Option<InteractiveCmd>; 4]) {
    for i in 0..cmds.len() {
      if let Some(cmd) = cmds[i] {
        match cmd {
          InteractiveCmd::GetKey(x, y) => {
            self.tiles[self.goal_tile_idx].id = TileId::GoalOpened;
            let idx = self.get_idx_from_pos(x, y);
            self.tiles[idx].id = TileId::Empty;
          }
          InteractiveCmd::GetFragment(x, y) => {
            self.fragment_count += 1;
            let idx = self.get_idx_from_pos(x, y);
            self.tiles[idx].id = TileId::Empty;
           }
          _ => {}
        }
        
      }
    }

  }

  pub fn set_stage(&mut self, id: StageID) {
    // ステージを切り替える
    let idx = id as usize;
    self.now_stage = DAT_STAGE_ALL[idx];
    self.now_stage_idx = idx;
    self.tiles = self.now_stage.get_tiles();
    self.setup();
  }
  pub fn goto_next_stage(&mut self) -> bool {
    self.now_stage_idx += 1;
    // クリア
    if self.now_stage_idx >= DAT_STAGE_ALL.len() {
      self.now_stage_idx = DAT_STAGE_ALL.len() - 1;
      return false;
    }
    // ステージ切り替え処理
    else {
      self.now_stage = DAT_STAGE_ALL[self.now_stage_idx];
      self.tiles = self.now_stage.get_tiles();
      self.setup();
      return true;
    }
  }
  pub fn get_start_pos(&self) -> (i16, i16) {
    // '@'の場所を取得(初回しか呼ばれないので線形探索)
    let start_tile = self.tiles.iter().find(|t| t.id == TileId::Start);
    match start_tile {
      Some(t) => (t.pos.x, t.pos.y),
      None => (0, 0)
    }
  }
  // 受け取った座標に存在するタイルを返す
  pub fn get_tile_from_pos(&self, px: i16, py: i16) -> Option<&Tile> {
    let idx = self.get_idx_from_pos(px, py);
    // 範囲外の座標ならNoneを返す
    if idx as usize >= self.tiles.len() { return None; }
    Some(&self.tiles[idx as usize])
  }
  pub fn get_tiles_from_pos(&self, x: i16, y: i16, w: i16, h: i16) -> [Option<&Tile>; 4] {
    [
      self.get_tile_from_pos(x, y),
      self.get_tile_from_pos(x+w-1, y),
      self.get_tile_from_pos(x, y+h-1),
      self.get_tile_from_pos(x+w-1, y+h-1),
    ]
  }
  pub fn draw(&self, offset_x: i16, offset_y: i16) {
    // ステージを描画する
    for y in 0..self.now_stage.height {
      for x in 0..self.now_stage.width {
        let idx = (self.now_stage.width * y + x) as usize;
        let tile = self.tiles[idx];
        // 空のタイルは描画しない
        if tile.id == TileId::Empty || tile.id == TileId::Start { continue; }
        // 画面内のタイルのみ描画する
        if tile.pos.x + offset_x + (STAGE_TILE_SIZE as i16) < 0 || tile.pos.x + offset_x > 160 ||
           tile.pos.y + offset_y + (STAGE_TILE_SIZE as i16) < 0 || tile.pos.y + offset_y > 160 { continue; }
        
        TILE_STAGE[tile.id as usize].draw((tile.pos.x + offset_x) as i32, (tile.pos.y + offset_y) as i32);
      }
    }
  }

}




// -------------------------------
// Stage Data
// -------------------------------
 // タイルの大きさ
const STAGE_TILE_SIZE: u16 = 16;
// 全てのステージデータを格納
const DAT_STAGE_ALL: &[&'static StageData; 3] = &[
  &DAT_STAGE_1,
  &DAT_STAGE_2,
  &DAT_STAGE_3,
];

// テンプレート
// const STAGE_hoge_WIDTH: u16 = 1;
// const STAGE_hoge_HEIGHT: u16 = 1;
// const STAGE_hoge [char; (STAGE_hoge_WIDTH*STAGE_hoge_HEIGHT) as usize] = [
//   ' ',
// ];
// const DAT_STAGE_hoge: StageData = StageData {
//   width: STAGE_hoge_WIDTH,
//   height: STAGE_hoge_HEIGHT,
//   tiles: STAGE_hoge
// };

// Stage 1
const STAGE_1_WIDTH: u16 = 32;
const STAGE_1_HEIGHT: u16 = 20;
const STAGE_1: [char; (STAGE_1_WIDTH*STAGE_1_HEIGHT) as usize] = [
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','g',' ','k',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','f',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#',' ',' ',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#',' ',' ',' ','#','#',' ',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#','^','^','^','#','#',' ',' ','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','^','^','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','f',' ',' ',' ','#',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ','#','#','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ','#','#','#','#',
  '#','@',' ',' ',' ',' ',' ','#','#','#','#',' ',' ',' ',' ','#','#',' ',' ',' ','#','#','#','#','#',' ',' ','#','#','#','#','#',
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#',
];
const DAT_STAGE_1: StageData = StageData {
  width: STAGE_1_WIDTH,
  height: STAGE_1_HEIGHT,
  data: &STAGE_1
};

// Stage 2
const STAGE_2_WIDTH: u16 = 23;
const STAGE_2_HEIGHT: u16 = 30;
const STAGE_2: [char; (STAGE_2_WIDTH*STAGE_2_HEIGHT) as usize] = [
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#',
  '#','#','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','f',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#','#','#',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#','#','f',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#','#','#','#','#',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#',' ',' ',' ','#',' ',' ','#','#','#','#','#','#','#','#','#','#','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','v','v','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#',' ',' ','#','#',' ',' ','#',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','^','^','#','#','^','^','#',' ',' ','#',
  '#',' ',' ',' ','#','#','#',' ',' ','#','#','#','#','#','#','#','#','#','#','#',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ','#','#',' ',' ',' ',' ','#',
  '#','#','#','#','#',' ',' ',' ',' ','#','#','#','#','#',' ',' ','#','>',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#',' ',' ','#','#','#','#','#',' ','k','#','>','#',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ','#','>',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#',' ',' ','#','>',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ','#','#','#','#','#','#',' ',' ','#','>','#','#',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ','#','#','#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','@',' ',' ',' ',' ','#','#','#','#','g',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#',
];
const DAT_STAGE_2: StageData = StageData {
  width: STAGE_2_WIDTH,
  height: STAGE_2_HEIGHT,
  data: &STAGE_2
};


const STAGE_3_WIDTH: u16 = 16;
const STAGE_3_HEIGHT: u16 = 40;
const STAGE_3: [char; (STAGE_3_WIDTH*STAGE_3_HEIGHT) as usize] = [
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#',
  '#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#','@',' ',' ',' ',' ','#','k',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#',' ',' ','#','#','#',' ',' ','#','#','#','#','#',
  '#',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ','#','#','#',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ','#','#','#',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ','#','#','#',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ','#','#','#',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ',' ','#',' ',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ',' ','#',' ',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#','#','#',' ','#','#',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ',' ',' ','#',' ',' ','#',' ',' ','#',' ',' ',' ','#',
  '#',' ',' ',' ',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ','#',' ',' ','#',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ','#',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ','#','#','#','#','#','#','#','#','#','#','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ',' ','#',
  '#',' ',' ',' ',' ','k','g','f',' ',' ',' ',' ',' ',' ',' ','#',
  '#','#','#','#','#','#','#','#','#','#','#','#','#','#','#','#',
];
const DAT_STAGE_3: StageData = StageData {
  width: STAGE_3_WIDTH,
  height: STAGE_3_HEIGHT,
  data: &STAGE_3,
};